src/cf/src/Documents/ПрочиеРасходыВозврат/ПрочиеРасходыВозврат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочиеРасходыВозврат</name>
  <basedOn>Document.ПрочиеРасходы</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПрочиеРасходы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧРасходы</name>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ПрочиеРасходыВозврат/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	НастроитьФорму();
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОперационныеЗатраты") Тогда 
		Объект.Сумма = Объект.ТЧРасходы.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	ЭтоОперационныеЗатраты = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОперационныеЗатраты;
	Элементы.Контрагент.Видимость = ЭтоОперационныеЗатраты;
	Элементы.СтатьяДДС.Видимость = ЭтоОперационныеЗатраты;
	Элементы.Сумма.Видимость = ЭтоОперационныеЗатраты;
	Элементы.ТЧРасходы.Видимость = Не ЭтоОперационныеЗатраты;
КонецПроцедуры

// Возврат в валюте расходов-основания (docs/plans/multicurrency-returns.md): валюта и курс - основания, только для
// просмотра; суммы - в валюте документа, проведение - в основной валюте.
//
&НаСервере
Процедура УстановитьВидимостьВалюты()
	ВВалюте = Объект.ВВалюте;
	Элементы.ВалютаКурс.Видимость = ВВалюте;
	ТекстСумма = НСтр("ru = 'Сумма'; fr = 'Montant'; en = 'Amount'; es = 'Importe'");
	// Пустой заголовок - заголовок по реквизиту.
	ЗаголовокСумма = ?(ВВалюте, РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, Объект.Валюта), "");
	Элементы.Сумма.Заголовок = ЗаголовокСумма;
	Элементы.ТЧРасходыСумма.Заголовок = ЗаголовокСумма;
КонецПроцедуры
